<!doctype html>
<html>
<head>
    <meta charset="utf-8">
    <title>欢迎来到我的个人博客</title>
    <meta name="keywords" content="个人博客" />
    <meta name="description" content="神秘、俏皮。" />
    <link href="./public/css/base.css" rel="stylesheet">
    <link href="./public/css/about.css" rel="stylesheet">
    <link href="./public/css/media.css" rel="stylesheet">
    <meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0">
    <!--[if lt IE 9]>
    <script src="./public/js/modernizr.js"></script>
    <![endif]-->
</head>
<body>
<div class="ibody">
    <header>
        <h1>朝闻道，夕死可矣</h1>
        <h2>博学之，审问之， 慎思之，明辨之，笃行之。</h2>
        <? if(Yii::$app->session->get('user')){ ?>
            <div class="logo"><a href="http:\\www.zyjfire.top"></a></div>
        <? } else { ?>
            <div class="logo"><a href="?r=login/index"></a></div>
        <? } ?>
        <nav id="topnav"><a href="?r=index/index">首页</a><a href="?r=index/about">关于我</a><a href="?r=life/index">慢生活</a><a href="?r=gossip/index">闲言碎语</a><a href="?r=technology/index">技术探讨</a><a href="?r=images/index">我的相册</a><a href="?r=messageboard/index">留言板</a></nav>
    </header>
    <article>
        <h3 class="about_h">您现在的位置是：<a href="?r=index/index">首页</a>><a href="?r=index/about">关于我</a></h3>
        <div class="about">
            <h2>Just about me</h2>
            <ul>
              <p>关于我，哎，没啥好说的</p>
            </ul>
            <h2>About my dream</h2>
            <ul class="blog_a">
                阿尔托莉雅

                才刚过成年仪式的少女，在那一天，被国内的人这么称呼着

                那是个战乱的时代

                战乱的开端，是一个帝国的灭亡

                原本应该是无敌的帝国，在众多异教徒的侵略下等待着死亡

                为了与异教徒战斗，帝国把原本守护一个岛国的兵力调走了

                那就是开始

                她的国家失去了帝国的庇护，无法继续独力后，很快地分裂成了一

                个个小王国

                异教徒的进攻

                部族间，可说是自杀行为的内斗

                之后，就是被称为"如夜晚般黑暗的日子"的长年征战时期

                就在这时，她以王的继承者的身分出生了

                那是个漫长的，战乱的时代

                国王相信魔术师的预言，期待着一个优秀的继承人

                可是生下的小孩，并不是国王所期待的人

                那孩子，不是男孩

                就算身上有着王的宿命，不是男孩就无法继承王位

                少女被寄养给一个家臣，以一名骑士的小孩的身分而成长

                虽然国王因此失望，但魔术师却很满意

                本来，性别就跟成为国王是没有关系的

                更重要的是，魔术师相信，少女在预言之日以前必须离开城堡的这

                件事，才是真正的国王之证

                少女在朴实而贤明的老骑士家中，以他继承人的身分成长

                并不是因为老骑士相信魔术师的预言

                老骑士在少女身上感到与主君同样的东西，所以才认为必须抚养她

                为一个骑士，期待着她的成长

                不过连期待都不用期待，少女就为了要比任何人都强地，一日复一

                日地锻炼

                如果能拯救这步向死亡的国家的，只有王的话

                那就无需他人多言，少女发誓了要为此而挥剑

                然后，预言之日到了

                为了选出国王，国王召集了国内的领主和骑士

                大家都猜想，既然是要选出最优秀的人当王，那就一定是马上战斗

                吧

                可是，在集合地点只准备了一把插在石头里的剑而已

                剑柄上有着黄金的铭文

                "将这把剑从岩石中拔出的人，就应当成为不列巅之王———"

                有许多骑士照着这铭文，抓住了这把剑

                但是没有人拔的出来，于是骑士们就照原先准备好的，开始以马上

                战斗选定国王

                那时少女还只是骑士候补，没有马上战斗的资格

                少女走近了四周无人的岩石，毫不犹豫地朝剑柄伸手

                「哎呀哎呀。在握住那东西前，还是先仔细想想比较好」

                回过头来，看到了在这国内最被敬畏的魔术师

                魔术师说了

                如果拔出了那东西，到最后你将不再是人类

                对于魔术师的话，少女只是点了点头

                成为国王，就得不再是人类

                这样的觉悟，是她从一生下来就有了的

                王也就是，为了守护人民，必须杀害最多人民的存在

                幼小的她，每天晚上都想着这个，颤抖着直到天亮

                没有一天不害怕的

                但是少女说，害怕也就到今天为止了

                剑就像理所当然一般被拔出，周围被光芒所包围

                ———在那瞬间，她就不是人类了

                王与性别无关

                只有有着王的机能，谁也不会去关心、去在意其样貌

                就算有人注意到了王是女性，只要是个优秀的王，应该就不会有问

                题

                因为剑的魔力，她的成长也就此停止

                虽然也有些骑士觉得不舒服而害怕，但大半的骑士都称颂着主君神

                秘的不死性

                ———然后

                就开始被后人称为传说的，王的时代

                新登基的国王，其战争有如军神所为

                王经常站在前线

                敌人全都望风披靡

                战神．阿尔托莉雅

                被歌颂作龙之化身的王，不可能败北

                十年沙场，十二场大战，全都以她的胜利作结

                那是一段专心地，以王的身份驰骋的日子吧

                她一次也没有回头，一次也没有受伤

                她以王的身分成长，而又贯彻了她的义务

                所以，我才会看到这样的幻象吗

                她那灵魂，现在也还在战场上吧

                破晓前

                在蓝色的天空下，她任凭微风吹着身体，只是朝远方眺望

                天空很高，云流动得很快

                在澄澈的空气中，她手上握着剑，看着应该迎击的大军

                ———那姿态，如烙印般地留了下来


                　天空被薄墨所染。
                　是黎明，亦或黄昏。
                　在外面眺望的我无法判别是哪一种。
                　在广阔的天空下，是高耸的草原。
                　伸手到不了的天空，
                　和似乎伸手就抓的到的云。
                　那里，是她过去奔驰的沙场之ㄧ。
                　手下没有骑兵。
                　也没有一望无际的草原。
                　钝色所染的天空下，满满的，
                　是不管怎么看，都是战场的痕迹。
                　情感并没有因此沸腾。
                　对她而言，这是日常的光景。
                　单独留下的心什么都没有。
                　用黄金之剑支撑身体的她大大吐了一口气，慢慢地双肩放松。
                　战争结束了吧。
                　看了一眼她讨伐的士兵遗骸后，往自己的阵地走去。
                　那是她所经验过的战争。
                　冷静的态度到现在完全都没有变。
                　她不管遭遇怎样的痛苦，都是我所认识的她。

                ————看着王的梦。

                　拔起那把剑开始，她就不是人了。
                　代替父亲成为领主后，成为许多骑士所效忠的身体。
                　她被称为阿瑟王或阿尔特莉亚，目标成为骑士的少女的人生完全改变了。
                　她以王之子身分活耀。
                　治理许多领地，统率骑士们的不是男人的身体不行。
                　知道王是少女的人，只有她的父亲和魔术师。
                　她如字上所说的用铁覆盖自己的身体，一生封印那个事实。
                　当然，不可能没有觉得奇怪的人。
                　但是握着圣剑的骑士王无法使其受伤，亦无衰老。
                　圣剑拥有妖精的守护，拥有的人可以不老不死。
                　因此，没有人想到身为骑士却太小的身体，怎么想都是少女的脸庞也以英俊的王而成为骑士们的荣耀。
                ———原本那就不成问题。
                　实际上，王是无敌的。
                　并没有因为体格或脸庞而有空隙。
                　怯于蛮族进攻的人民追求的是强壮的王，奔驰战场上的骑士效忠的是优秀的统率者而已。
                　王拥有全部的条件。
                　因此———没有人追求王到底是什么人。
                　就算是女人或小孩也没关系。
                　只要，那个以『王』的身分保护这个国家就好了。
                　新的王是非常公平无私，常在战场上打头阵驱逐敌人。
                　众多的敌人和人民因此死去，但是王的选择是正确的，比谁都更适合『王』。
                　而且也没有怀疑的空闲，怀疑王也没有意义吧。
                　战场上不知道战败为何物。
                　由失传的骑马形式再构成的她的军队，如文字所说在战场上自由奔驰，击破异族的步兵，突破好几个城堡。
                　常常在战场上打先锋是因为国家就在背后。
                　为了出战，不舍弃许多人民不行。
                　因为出战，不杀死所有敌人不行。
                　为了保护国家，榨干自己国家的村庄整顿军备是常道。
                　就那个意义来说，没有像她杀了那么多人的骑士吧。
                　不知是否感到沉重过。
                　那不好在这梦里知道。
                　但是，奔驰在战场上的身影没有迷惑。
                　坐在玉座的时候也没有因为忧伤而闭上眼睛。
                　王并不是人。
                　拥有人类感情，就无法保护人。
                　她严格遵守那个誓言。
                　解决所有的问题，谁都没话说地勤于政务。
                　完全理性地规划国家，完全公正地处罚人。
                　然后，数次的战争以胜利为结束，统率几个部族，处罚数百个罪人后。
                "阿瑟王不懂人类的感情"
                　侧近的骑士如此自言自语。
                　大家都怀有那份不安吗。
                　以王而言完美某种地步时，大家对自己的君主产生疑问。
                　没有人类感情的人是无法治理人的。
                　几个有名的骑士离开离白色的王城，连这样子王也像当然的事情地接受，看成是统治的一部分。
                　骑士们所荣耀的英俊的王，逐渐被孤立。
                　但是，对王而言那是没关系的小事。
                　被远离，被恐惧，被背叛，她的心还是不变。
                　一点都没有。
                　决意握住那把剑的时候开始，她就舍弃感情。
                ———然后，对她而言最后一战开始了。
                　巴顿之丘上的战争以大胜利做结束，过于压倒性的战果让蛮族祈求和谈。
                　只是等待不久之后即将灭亡的国家得到短暂的和平。
                　靠着绝对的英雄结束战乱。
                　不列颠终于慢慢回到她所梦想的国家。
            </ul>
        </div>
    </article>
    <aside>
        <div class="avatar"><a href="http:\\www.zyjfire.top"><span>遇见</span></a></div>
        <div class="topspaceinfo">
            <h1>While there is life there is hope.</h1>
            <p>冬之城大魔法师梅林: <br>能将此剑拔出岩石之勇士,即是将成为不列颠之王之人,阿尔托莉娅啊,于拔剑前,请尚再仔细考虑,一旦获得此剑,汝将不再可为人类...<br>Saber:<br>吾明解,吾愿即为求剑而来.</p>
        </div>
        <div class="about_c">
            <p>职业：PHP</p>
            <p>籍贯：山西</p>
            <p>电话：183********</p>
            <p>邮箱：zyjfire@foxmail.com</p>
            <p>爱好：没啥爱好，打游戏算吗┑(￣Д ￣)┍</p>
            <p>
                <a target="_blank" href="http://sighttp.qq.com/authd?IDKEY=cfd147405c724509a3b338fec76ac6b8d20ed108e2eb24ef"><img border="0"  src="http://wpa.qq.com/imgd?IDKEY=cfd147405c724509a3b338fec76ac6b8d20ed108e2eb24ef&pic=51" alt="嗨，有什么烦心的事，和我聊聊吧" title="嗨，有什么烦心的事，和我聊聊吧"/></a>
            </p>
        </div>
    </aside>
    <script src="./public/js/silder.js"></script>
    <div class="clear"></div>
    <!-- 清除浮动 -->
</div>
<?= $background?>
</body>
</html>
