smile/frontend/models/MyUser.php

SELECT * FROM `my_user` WHERE ( username = '楪祈') AND (password = '208734853547932')
---
    public function login($where, $user, $pwd)
    {
        return $this->find()->where(" $where = :user",[':user'=>$user])->andWhere("password = :pwd",[':pwd'=>$pwd])->asArray()->one();

UPDATE `my_user` SET `final_ip`='127.0.0.1', `final_time`='2017-05-23 20:22:19' WHERE `id`='1'
---
    public function loginDO($data, $id)
    {
        return $this->updateAll($data,['id'=> $id]);